{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 1344], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "sigmoid", "name": "dense_3", "units": 1344, "use_bias": true, "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "softmax", "name": "dense_4", "units": 2, "use_bias": true, "trainable": true}}], "keras_version": "2.0.0", "backend": "tensorflow"}