{"keras_version": "2.0.0", "backend": "tensorflow", "config": [{"config": {"kernel_regularizer": null, "trainable": true, "units": 168, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 168], "dtype": "float32", "name": "dense_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "bias_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_2", "units": 11, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_2"}, "class_name": "Activation"}], "class_name": "Sequential"}