{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "name": "l0", "activation": "relu", "batch_input_shape": [null, 12], "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "units": 13, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "name": "final", "activation": "softmax", "batch_input_shape": [null, 1], "use_bias": true, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "units": 3, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.0"}