{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"activation": "sigmoid", "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "dtype": "float32", "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "batch_input_shape": [null, 1344], "units": 1344, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_regularizer": null, "name": "dense_4", "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "units": 2}}], "keras_version": "2.0.0"}