{"class_name": "Sequential", "keras_version": "2.0.0", "config": [{"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true, "units": 13, "dtype": "float32", "name": "l0", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 12], "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true, "units": 13, "dtype": "float32", "name": "l1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 13], "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true, "units": 7, "name": "l2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "bias_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "trainable": true, "units": 3, "dtype": "float32", "name": "final", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 7], "bias_regularizer": null}}], "backend": "tensorflow"}